# Функции

"""Функции – это многократно используемые фрагменты программы. Они позволяют дать
имя определённому блоку команд с тем, чтобы в последствии запускать этот блок по
указанному имени в любом месте программы и сколь угодно много раз. Это называется
вызовом функции. Мы уже использовали много встроенных функций, как то len и range.
Функция – это, пожалуй, наиболее важный строительный блок любой нетривиальной
программы (на любом языке программирования), поэтому в этой главе мы рассмотрим
различные аспекты функций.
Функции определяются при помощи зарезервированного слова def. После этого слова
указывается имя функции, за которым следует пара скобок, в которых можно указать
имена некоторых переменных, и заключительное двоеточие в конце строки. Далее сле-
дует блок команд, составляющих"""

# def sayHello():
#     print('Привет, Мир!') # блок, принадлежащий функции
#     # Конец функции


# sayHello() # вызов функции
# sayHello() # ещё один вызов функции
